brianwyld/ble_nrf52_v2/src/main.c
    _ctx.m_beacon_info[0] = _ctx.device_type;
    _ctx.m_beacon_info[1] = _ctx.adv_data_length;
    memcpy(&_ctx.m_beacon_info[2], cfg_getUUID(), UUID128_SIZE);

    _ctx.m_beacon_info[18] = MSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[19] = LSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[20] = MSB_16(cfg_getMinor_Value());
    _ctx.m_beacon_info[21] = LSB_16(cfg_getMinor_Value());
    
    _ctx.m_beacon_info[22] = makeAdvPowerLevel();

    manuf_specific_data.data.p_data = (uint8_t *) (&_ctx.m_beacon_info[0]);
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;
 
    // Build advertising data struct to pass into @ref ble_advertising_init.
/*
    if (ble_device_type == UART_MODULE)
    {
        advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = false;
        advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    }
    */
    advdata.name_type             = BLE_ADVDATA_NO_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);
    
    // Initialize advertising parameters (used when starting advertising).
    memset(&_ctx.m_adv_params, 0, sizeof(_ctx.m_adv_params));
    _ctx.m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    _ctx.m_adv_params.p_peer_addr = NULL;                             // Undirected advertisement.
    _ctx.m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    _ctx.m_adv_params.interval    = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS); //NON_CONNECTABLE_ADV_INTERVAL;
    _ctx.m_adv_params.timeout     = APP_CFG_NON_CONN_ADV_TIMEOUT;
 
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;
    scanrsp.name_type = BLE_ADVDATA_FULL_NAME;
    scanrsp.p_tx_power_level = &txPowerLevel;

    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS);
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
    options.ble_adv_slow_enabled = true;
    options.ble_adv_slow_interval = MSEC_TO_UNITS(APP_ADV_INTERVAL_SLOW, UNIT_0_625_MS);     //1285*1.6;
    options.ble_adv_slow_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
 
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}
 
 
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
/*
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;
 
    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);
 
    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
 
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

static bool advertising_check_start()
{
    uint32_t err_code;
    // in all cases, setup to be ready otherwise the ble_advertisting_start() will fail with wrong state error
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    cfg_resetPasswordOk();
    // Change name
    sd_ble_gap_device_name_set(&sec_mode,
                            (const uint8_t *)(cfg_getAdvName()),
                                strlen(cfg_getAdvName()));

    // Change tx power level
    sd_ble_gap_tx_power_set(cfg_getTXPOWER_Level());

    advertising_setup();
    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((cfg_getConnectable()!=0 || _ctx.isIBeaconning)) // && ibs_is_scan_active()==false)
    {
        err_code = ble_advertising_start(_ctx.isIBeaconning?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
        APP_ERROR_CHECK(err_code);
        return true;
    } else {
        //idle the adverts
        err_code = ble_advertising_start(BLE_ADV_MODE_IDLE);
        APP_ERROR_CHECK(err_code);
        return false;
    }
}
 
// Callback when system events happen
static void sys_evt_handler(uint32_t evt)
{
    switch(evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            _ctx.flashBusy = false;
        break;
        
        case NRF_EVT_FLASH_OPERATION_ERROR:
            _ctx.flashBusy = false;         // Still finished though
        break;
        
        default:
        break;
    }
}




 
/*
static void deinit_uart_timeout_handler(void * p_context)
{
    comm_uart_deinit();
    
    //
    //examples to setup TX/RX in different mode :
    //
    //nrf_gpio_cfg_default(RX_PIN_NUMBER);
    //nrf_gpio_cfg_default(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_output(RX_PIN_NUMBER);
    //nrf_gpio_pin_set(RX_PIN_NUMBER);
    //nrf_gpio_cfg_output(TX_PIN_NUMBER);
    //nrf_gpio_pin_set(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_input(RX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
    //nrf_gpio_cfg_input(TX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
}
*/

/* one time system init */
static void system_init(void)
{            
    softdevice_sys_evt_handler_set(sys_evt_handler);
        
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
}

/* One time boot init of ble stack */
static void ble_init(void) {
    db_discovery_init();

    ble_stack_init();

    gap_params_init();
    services_init();

    // Initialise connection parameters
    conn_params_init();
    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */
}

// Control of beaconning activity
bool ibb_isBeaconning() {
    return _ctx.isIBeaconning;
}

void ibb_start() {
    _ctx.isIBeaconning=true;
    advertising_check_start();
}
void ibb_stop() {
    _ctx.isIBeaconning=false;
    advertising_check_start();
}

/** request a reset asap */
void app_reset_request() {
    _ctx.resetRequested = true;    
}

void app_setFlashBusy() {
    _ctx.flashBusy = true;      // someone somewhere is writing to the flash
}
bool app_isFlashBusy() {
    return _ctx.flashBusy;      // they would like to know if its busy right now
}

int main(void)
{
    system_init();
    // Init uart asap in case using for logs also
    comm_uart_init(); // REV B invert TX RX for board//

#ifdef RELEASE_BUILD
    wlog_init(-1);      // replace by 0 to get logs on uart
#else 
    wlog_init(0);      // replace by 0 to get logs on uart
#endif
    cfg_init();              
   log_info("config/log init done");
    
    ble_init();
   log_info("ble system init done");
    // Tell host we are ready to rock
    comm_uart_tx((uint8_t *)"READY\r\n",7, NULL);
    // Init adv parameters and start if required
    advertising_check_start();

   log_info("waiting for commands");
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        cfg_writeCheck();
        
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
        comm_uart_tx((uint8_t *)"*",1, NULL);
    }
}
